Practicas en PHP/library-system/app/Entities/AuthorEntity.php

    protected function getBooks()
    {
        if (!empty($this->attributes['id'])) {
            $AuthorsBooksModel = model('AuthorsBooksModel');
            $joins = $AuthorsBooksModel->where('author_id', $this->attributes['id'])->findAll();

            foreach ($joins as $join) {
                $AuthorModel = model('AuthorModel');
                $authors[] = $AuthorModel->where('id', $join['book_id'])->first();
---
SELECT *
FROM `authors__books`
WHERE `author_id` = '1'
SELECT *
FROM `authors`
WHERE `id` = '3'
AND `authors`.`deleted_at` IS NULL
 LIMIT 1