Practicas en PHP/library-system/app/Entities/BookEntity.php

    protected function getAuthors()
    {
        if (!empty($this->attributes['id'])) {
            $AuthorsBooksModel = model('AuthorsBooksModel');
            $joins = $AuthorsBooksModel->where('book_id', $this->attributes['id'])->findAll();

            foreach ($joins as $join) {
                $AuthorModel = model('AuthorModel');
                $authors[] = $AuthorModel->where('id', $join['author_id'])->first();
---
SELECT *
FROM `authors__books`
WHERE `book_id` = '3'
SELECT *
FROM `authors`
WHERE `id` = '1'
AND `authors`.`deleted_at` IS NULL
 LIMIT 1