Practicas en PHP/library-system/app/Controllers/Author.php

SELECT *
FROM `authors`
WHERE `authors`.`deleted_at` IS NULL
---
    public function index()
    {
        $data['authors'] = $this->model->findAll();

SELECT *
FROM `countries`
---
    public function new()
    {
        $paisModel = new \App\Models\CountryModel();
        $data['countries'] = $paisModel->findAll();

INSERT INTO `authors` (`name`, `surname`, `country_id`, `created_at`, `updated_at`) VALUES ('hjkhi876867867', '867867867867', '13', '2023-01-13 03:30:13', '2023-01-13 03:30:13')
---
    public function create()
    {
        $data = [
            'name' => $this->request->getVar('name'),
            'surname'  => $this->request->getVar('surname'),
            'country_id'  =>  $this->request->getVar('country'),
        ];

        $author = new $this->entity($data);

        $this->model->save($author);

SELECT *
FROM `authors`
WHERE `authors`.`deleted_at` IS NULL
AND `authors`.`id` = '2'
---
    public function show($id = null)
    {
        $data['author'] = $this->model->where('id', $id)->first();