Practicas en PHP/library-system/app/Controllers/Book.php

    public function index()
    {
        $data['books'] = $this->model->findAll();
---
SELECT *
FROM `books`

    public function new()
    {
        $data['authors'] = model('AuthorModel')->findAll();
---
SELECT *
FROM `authors`
WHERE `authors`.`deleted_at` IS NULL

    public function create()
    {
        $data = $this->request();

        $book = $this->model->insert($data);
---
INSERT INTO `books` (`title`, `edition`, `created_at`, `updated_at`) VALUES ('hjkjhkhjkh', 'khkhhjhjik', '2023-01-13 03:24:57', '2023-01-13 03:24:57')

    public function show($id = null)
    {

        $data['book'] = $this->model->find($id);
---
SELECT *
FROM `books`
WHERE `id` = '3'
 LIMIT 1

    public function edit($id = null)
    {
        $data['authors'] = model('AuthorModel')->findAll();
---
SELECT *
FROM `authors`
WHERE `authors`.`deleted_at` IS NULL