Practicas en PHP/library-system/app/Models/BookModel.php

UPDATE `books` SET `title` = 'jhgjhgjhgjhgjhgjhgjhgjhgj', `edition` = 'hgjhgjhgjhgjhgjhgjghjgh', `updated_at` = '2023-01-13 20:00:56'
WHERE `books`.`id` IN ('7')
INSERT INTO `books` (`title`, `edition`, `created_at`, `updated_at`) VALUES ('ghjghjghjghjghjghj', 'ghjghjghjghj', '2023-01-13 20:06:29', '2023-01-13 20:06:29')
INSERT INTO `authors__books` (`author_id`, `book_id`, `created_at`, `updated_at`) VALUES ('1', 8, '2023-01-13 20:06:29', '2023-01-13 20:06:29')
---
    public function transBooksTutors($data, $id = null)
    {
        $this->db->transStart();

        $authorsBooksModel = model('AuthorsBooksModel');

        if ($id) {
            foreach ($data['authors'] as $author) {
                $authorsBooksModel->where('book_id', $id)->delete();
            }
            $this->update($id, $data);
        } else {
            $book = $this->insert($data);
        }

        foreach ($data['authors'] as $author) {
            $authorsBooksModel->insert(
                ['author_id' => $author, 'book_id' => $book ?? $id]
            );